[
    {
      "id": 1,
      "title": "Lamborghini Huracan Sterrato",
      "price": 278972,
      "description": "The Lamborghini Huracan Sterrato is a limited edition off-road variant of the iconic Huracan supercar, designed to tackle rough terrains with its lifted suspension and rugged exterior features. With its powerful V10 engine and all-wheel drive system, it offers an exhilarating blend of high-performance driving and off-road capability.",
      "make": "Lamborghini",
      "image": "https://www.motortrend.com/uploads/2023/05/2023-Lamborghini-Huraca%CC%81n-Sterrato-in-action-1-scaled.jpg",
      "rating": { "rate": 2, "count": 760 }
    },
    {
      "id": 2,
      "title": "Pagani Utopia",
      "price": 2500000,
      "description": "The Pagani Utopia is a futuristic hypercar masterpiece, meticulously crafted with cutting-edge technology and exquisite design to redefine automotive luxury and performance. With its bespoke craftsmanship and unparalleled attention to detail, the Utopia embodies the pinnacle of automotive artistry and engineering excellence.",
      "make": "Pagani",
      "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTghqKP_wkqMKlbmaD_1r5f7YdHD5JE29cUCw&s",
      "rating": { "rate": 1.5, "count": 259 }
    },
    {
      "id": 3,
      "title": "Bugatti Veyron",
      "price": 2300000,
      "description": "The Bugatti Veyron is an automotive legend, renowned for its unparalleled speed and engineering prowess. With its groundbreaking quad-turbocharged W16 engine and aerodynamic design, the Veyron remains a symbol of automotive perfection and performance innovation.",
      "make": "Bugatti",
      "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRCri9V51rnNDQE7qaFPzmzj4Vnws7Eu-uLUw&s",
      "rating": { "rate": 1.2, "count": 554 }
    },
    {
      "id": 4,
      "title": "2002 Toyota Camry",
      "price": 5015.99,
      "description": "The 2002 Toyota Camry is a midsize sedan that embodies reliability, comfort, and practicality. With its sleek and timeless design, the Camry maintains a classic appearance that appeals to a wide range of drivers. Its exterior features smooth lines, a modest grille, and large headlights, giving it a sophisticated yet understated look.",
      "make": "Toyota",
      "image": "https://file.kelleybluebookimages.com/kbb/base/house/2002/2002-Toyota-Camry-FrontSide_TOCAMLE021_505x375.jpg?interpolation=high-quality&downsize=303:*",
      "rating": { "rate": 5.0, "count": 630 }
    },
    {
      "id": 5,
      "title": "McLaren F1",
      "price": 800000,
      "description": "The McLaren F1, introduced in 1992, remains one of the most iconic and revered supercars in automotive history. Designed by Gordon Murray and manufactured by McLaren Automotive, the F1 was ahead of its time in terms of performance, engineering, and innovation.",
      "make": "McLaren",
      "image": "https://robbreport.com/wp-content/uploads/2019/12/6092563g.jpg?w=1000",
      "rating": { "rate": 2.2, "count": 400 }
    },
    {
      "id": 6,
      "title": "2018 Mclaren 570S MSO X",
      "price": 450000,
      "description": "The 2018 McLaren 570S MSO X is a limited-edition variant of the already impressive McLaren 570S sports car, crafted by McLaren Special Operations (MSO), the bespoke division of McLaren Automotive. This exclusive model was designed specifically for North American customers, with only ten units produced, making it highly sought after among collectors and enthusiasts.",
      "make": "McLaren",
      "image": "https://www.ilusso.com/imagetag/1312/main/l/Used-2018-McLaren-MSO-X-1688439859.jpg",
      "rating": { "rate": 1.1, "count": 70 }
    }
  ]
  