[
    {
      "id": 1,
      "title": "Lamborghini Huracan Sterrato",
      "price": 278972,
      "description": "The Lamborghini Huracan Sterrato is a limited edition off-road variant of the iconic Huracan supercar, designed to tackle rough terrains with its lifted suspension and rugged exterior features. With its powerful V10 engine and all-wheel drive system, it offers an exhilarating blend of high-performance driving and off-road capability.",
      "make": "Lamborghini",
      "image": "https://www.motortrend.com/uploads/2023/05/2023-Lamborghini-Huraca%CC%81n-Sterrato-in-action-1-scaled.jpg",
      "rating": { "rate": 2, "count": 760 }
    },
    {
      "id": 2,
      "title": "Pagani Utopia",
      "price": 2500000,
      "description": "The Pagani Utopia is a futuristic hypercar masterpiece, meticulously crafted with cutting-edge technology and exquisite design to redefine automotive luxury and performance. With its bespoke craftsmanship and unparalleled attention to detail, the Utopia embodies the pinnacle of automotive artistry and engineering excellence.",
      "make": "Pagani",
      "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTghqKP_wkqMKlbmaD_1r5f7YdHD5JE29cUCw&s",
      "rating": { "rate": 1.5, "count": 259 }
    },
    {
      "id": 3,
      "title": "Bugatti Veyron",
      "price": 2300000,
      "description": "The Bugatti Veyron is an automotive legend, renowned for its unparalleled speed and engineering prowess. With its groundbreaking quad-turbocharged W16 engine and aerodynamic design, the Veyron remains a symbol of automotive perfection and performance innovation.",
      "make": "Bugatti",
      "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRCri9V51rnNDQE7qaFPzmzj4Vnws7Eu-uLUw&s",
      "rating": { "rate": 1.2, "count": 554 }
    },
    {
      "id": 4,
      "title": "Mens Casual Slim Fit",
      "price": 15.99,
      "description": "The color could be slightly different between on the screen and in practice. / Please note that body builds vary by person, therefore, detailed size information should be reviewed below on the product description.",
      "category": "men's clothing",
      "image": "https://fakestoreapi.com/img/71YXzeOuslL._AC_UY879_.jpg",
      "rating": { "rate": 2.1, "count": 430 }
    },
    {
      "id": 5,
      "title": "John Hardy Women's Legends Naga Gold & Silver Dragon Station Chain Bracelet",
      "price": 695,
      "description": "From our Legends Collection, the Naga was inspired by the mythical water dragon that protects the ocean's pearl. Wear facing inward to be bestowed with love and abundance, or outward for protection.",
      "category": "jewelery",
      "image": "https://fakestoreapi.com/img/71pWzhdJNwL._AC_UL640_QL65_ML3_.jpg",
      "rating": { "rate": 4.6, "count": 400 }
    },
    {
      "id": 6,
      "title": "Solid Gold Petite Micropave ",
      "price": 168,
      "description": "Satisfaction Guaranteed. Return or exchange any order within 30 days.Designed and sold by Hafeez Center in the United States. Satisfaction Guaranteed. Return or exchange any order within 30 days.",
      "category": "jewelery",
      "image": "https://fakestoreapi.com/img/61sbMiUnoGL._AC_UL640_QL65_ML3_.jpg",
      "rating": { "rate": 3.9, "count": 70 }
    }
  ]
  