[
    {
      "id": 1,
      "title": "Fjallraven - Foldsack No. 1 Backpack, Fits 15 Laptops",
      "price": 109.95,
      "description": "Your perfect pack for everyday use and walks in the forest. Stash your laptop (up to 15 inches) in the padded sleeve, your everyday",
      "category": "men's clothing",
      "image": "https://fakestoreapi.com/img/81fPKd-2AYL._AC_SL1500_.jpg",
      "rating": { "rate": 3.9, "count": 120 }
    },
    {
      "id": 2,
      "title": "Mens Casual Premium Slim Fit T-Shirts ",
      "price": 22.3,
      "description": "Slim-fitting style, contrast raglan long sleeve, three-button henley placket, light weight & soft fabric for breathable and comfortable wearing. And Solid stitched shirts with round neck made for durability and a great fit for casual fashion wear and diehard baseball fans. The Henley style round neckline includes a three-button placket.",
      "category": "men's clothing",
      "image": "https://fakestoreapi.com/img/71-3HjGNDUL._AC_SY879._SX._UX._SY._UY_.jpg",
      "rating": { "rate": 4.1, "count": 259 }
    },
    {
      "id": 3,
      "title": "Mens Cotton Jacket",
      "price": 55.99,
      "description": "great outerwear jackets for Spring/Autumn/Winter, suitable for many occasions, such as working, hiking, camping, mountain/rock climbing, cycling, traveling or other outdoors. Good gift choice for you or your family member. A warm hearted love to Father, husband or son in this thanksgiving or Christmas Day.",
      "category": "men's clothing",
      "image": "https://fakestoreapi.com/img/71li-ujtlUL._AC_UX679_.jpg",
      "rating": { "rate": 4.7, "count": 500 }
    },
    {
      "id": 4,
      "title": "2002 Toyota Camry",
      "price": 5015.99,
      "description": "The 2002 Toyota Camry is a midsize sedan that embodies reliability, comfort, and practicality. With its sleek and timeless design, the Camry maintains a classic appearance that appeals to a wide range of drivers. Its exterior features smooth lines, a modest grille, and large headlights, giving it a sophisticated yet understated look.",
      "make": "Toyota",
      "image": "https://file.kelleybluebookimages.com/kbb/base/house/2002/2002-Toyota-Camry-FrontSide_TOCAMLE021_505x375.jpg?interpolation=high-quality&downsize=303:*",
      "rating": { "rate": 5.0, "count": 630 }
    },
    {
      "id": 5,
      "title": "McLaren F1",
      "price": 800000,
      "description": "The McLaren F1, introduced in 1992, remains one of the most iconic and revered supercars in automotive history. Designed by Gordon Murray and manufactured by McLaren Automotive, the F1 was ahead of its time in terms of performance, engineering, and innovation.",
      "make": "McLaren",
      "image": "https://robbreport.com/wp-content/uploads/2019/12/6092563g.jpg?w=1000",
      "rating": { "rate": 2.2, "count": 400 }
    },
    {
      "id": 6,
      "title": "2018 Mclaren 570S MSO X",
      "price": 450000,
      "description": "The 2018 McLaren 570S MSO X is a limited-edition variant of the already impressive McLaren 570S sports car, crafted by McLaren Special Operations (MSO), the bespoke division of McLaren Automotive. This exclusive model was designed specifically for North American customers, with only ten units produced, making it highly sought after among collectors and enthusiasts.",
      "make": "McLaren",
      "image": "https://www.ilusso.com/imagetag/1312/main/l/Used-2018-McLaren-MSO-X-1688439859.jpg",
      "rating": { "rate": 1.1, "count": 70 }
    }
  ]
  